CREATED_FOR = '@progeri_chat'
BOT_USERNAME = '@playground_bws_bot'

GREETING = 'Привет username! ' \
           'Этот бот создан для чата %s ' \
           'Но ты его можешь использовать где угодно ' \
           'просто потому что можешь.\n\n' \
           '' \
           'Данный бот нужен для обмена NSFW контентом внутри' \
           ' чатов где он запрещен.\n\n' \
           'Команды:\n' \
           '/create_nsfw - создать запись с NSFW контентом(контент прикрепляется вместе с командой,' \
           ' не больше 1й фотки)\n' \
           '' \
           '/delete_nsfw - удалить мой NSFW контент\n\n' \
           '' \
           'Использование:\n' \
           'Бот работает с помощью inline, просто введи %s ' \
           'и тебе покажут все твои посты' % (CREATED_FOR, BOT_USERNAME)
SEND_ME_A_PHOTO = 'Отправь мне фото'
LIMIT_EXCEEDED = 'Лимит на количество контента исчерпан, используй /delete_nsfw' \
                 ' или удали свой контент прямо там, где он прислан'
ADD_DONE = 'Контент успешно добавлен'
VIEW_PROMPT = 'Отправлен NSFW контент'
CONTENT_NOT_FOUND = 'Контент не найден'
BOT_NOT_STARTED = 'Перед тем, как использовать бота нужно его запустить'
CHECK_PM = 'Проверьте личные сообщения'
NO_RIGHTS = 'Нет прав на данное действие'
CONTENT_REMOVED = 'Контент удален'
